Autodesk.Revit.DB.PartUtils.FindMergeableClusters(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Segregates a set of elements into subsets which are
valid for merge.
Remarks:
Element ids in the input set that do not correspond to Part
elements will be ignored, as will element ids corresponding
to Part elements that already have associated parts.
doc:
The document.
partIds:
A set of element ids.
Returns:
An array of clusters such that all the elements in a single cluster
are valid for merge. Each cluster will be maximal in that appending
any of the other Parts specified as input will result in a collection
that is not valid for merge.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartUtils.CreateMergedPart(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Create a single merged part which represents the Parts
specified by partsToMerge.
document:
The document.
partIds:
The elements that the merged part will be created from.
Returns:
The newly created PartMaker. null if no parts are merged.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not suitable for merging with the others.
Specified elements should all be Parts, report the same material,
creation and demolition phases, and have contiguous geometry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.PartUtils.ArePartsValidForMerge(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Identifies whether Part elements may be merged.
document:
The document.
partIds:
Element ids of Parts.
Returns:
True if all element ids correspond to Part elements,
none of the parts already has associated parts,
the parts have contiguous geometry, all report the same materials,
and all have the same creation and demolition phases.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartUtils.ArePartsValidForDivide(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Identifies if provided members are valid for dividing parts.
document:
The document.
elementIdsToDivide:
Element ids to be tested for validity for dividing parts.
Returns:
True if all member ids are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartUtils.AreElementsValidForCreateParts(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Identifies if the given elements can be used to create parts.
document:
The document.
elementIds:
Element ids to be tested for validity for creating parts.
Returns:
True if all member ids are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PartUtils.DivideParts(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList`1{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.ElementId)
Creates divided parts out of parts.
document:
The document containing the parts.
elementIdsToDivide:
The elements that will be divided.
intersectingReferenceIds:
Intersecting references that will divide the elements.
curveArray:
Array of curves that will divide the elements.
sketchPlaneId:
SketchPlane id for the curves that divide the elements.
Returns:
The newly created PartMaker. null if no parts are divided.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted for dividing parts.
Elements should be parts that are not yet divided and maximum distance from an original has not yet been reached.
-or-
One or more element ids was not permitted as intersecting references.
Intersecting references should be levels, grids, or reference planes.
-or-
The element id should refer to a valid SketchPlane.
-or-
The input curveArray contains at least one helical curve and is not supported for this operation.
-or-
The input curveArray contains at least one NULL pointer and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012

Autodesk.Revit.DB.PartUtils.CreateParts(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Creates a new set of parts out of the original elements.
Remarks:
Parts will be added to the model after regeneration.
document:
The document containing the elements.
elementIds:
The elements that parts will be created from.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted for creating parts.
Elements should be of a valid category and the ids should be valid and should not already be divided into parts.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012

Autodesk.Revit.DB.PartUtils.CreateParts(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.LinkElementId})
Creates a new set of parts out of the original elements.
Remarks:
Parts will be added to the model after regeneration.
To get the ids of the parts created by this method use PartUtils.GetAssociatedParts() with the contents of hostOrLinkElementIds.
document:
The document containing the elements.
hostOrLinkElementIds:
The elements that parts will be created from.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted for creating parts.
HostOrLinkElements should be of a valid category and the ids should be valid and should not already be divided into parts.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013